var website_title = "许祖耀 | XU ZUYAO | 大四 | 👋"
var name="许祖耀"
var profile = {
  "name": "许祖耀",
  "mbti": "INFJ📗",
  "status": "早八晚十，状态稳定✨",
  "work":"🌱 在努力学习\"DNS安全协议扩展（DNSSEC）\"",

  "undergraduate": {
      "school": "中国石油大学（华东）",
      "major": "计算机科学与技术专业",
      "stsuts": "2021级本科生 | 本科四年级"
  },
  "postgraduate":{
    "school": "南开大学",
    "major": "网络空间安全专业",
    "status": "2025级硕士研究生（预录取）"
  }
}

var news = [
  {
    "tag": "gold",
    "date": "12/2024",
    "title": "荣获突出成绩奖学金",
    "description": "因取得计设国家一等奖，团队荣获突出成绩奖学金！+3000￥"
  },
  {
    "tag": "gold",
    "date": "12/2024",
    "title": "荣获卓越之星奖学金",
    "description": "因取得软件杯国家二等奖，团队荣获卓越之星奖学金！+2000￥"
  },
  {
    "tag": "gold",
    "date": "12/2024",
    "title": "荣获科技创新奖学金",
    "description": "根据获奖赋分，荣获科创奖学金！+800￥"
  },
  {
    "tag": "gold",
    "date": "12/2024",
    "title": "荣获2024优秀学生称号",
    "description": "Easy！"
  },
  {
    "tag": "green",
    "date": "11/2024",
    "title": "分享竞赛经验",
    "description": "受学生会邀请，分享参赛经验📚"
  },
  {
    "tag": "gold",
    "date": "11/2024",
    "title": "荣获国家奖学金💯",
    "titleLink": "https://baike.baidu.com/item/%E5%9B%BD%E5%AE%B6%E5%A5%96%E5%AD%A6%E9%87%91/9693046?fr=ge_ala",
    "description": "在奖学金答辩中以95.3分第一名的成绩获得获得奖学金（￥10000, 2/120）👏"
  },
  {
    "tag": "green",
    "date": "10/2024",
    "title": "荣获2023-2024年优秀学生称号",
    "description": "以综测第五的成绩获得2023-2024年优秀学生称号🎉"
  },
  {
    "tag": "green",
    "date": "10/2024",
    "title": "荣获科技创新奖学金",
    "description": "以185分的赋分获得2023-2024年科技创新奖学金👏"
  },
  {
    "tag": "blue",
    "date": "11/2024",
    "title": "为NLnet Labs贡献pr⚡",
    "titleLink": "https://github.com/gopacket/gopacket",
    "description": "为社区版gopacket贡献了一个pr，为开源社区贡献力量！"
  },
  {
    "tag": "blue",
    "date": "09/2024",
    "title": "为NLnet Labs贡献pr⚡",
    "titleLink": "https://github.com/NLnetLabs",
    "description": "为NLnet Labs的开源解析器Unbound贡献了一个pr，第一次参与到开源项目中！🐞"
  },
  {
    "tag": "gold",
    "date": "09/2024",
    "title": "南开大学预录取🌟",
    "titleLink": "https://cc.nankai.edu.cn/2024/0930/c13297a552214/page.htm",
    "description": "以复试第一的成绩被南开大学网络安全学院预录取，师从李想副教授，即将前往南开大学深造，新旅程！🎓"
  },
  {
    "tag": "green",
    "date": "09/2024",
    "title": "小慧🤖荣获国家三等奖",
    "titleLink": "https://net.c4best.cn/",
    "description": "恭喜AI助理小慧获得2024中国高校计算机大赛-网络技术挑战赛国家三等奖！🥉",
  },
  {
    "tag": "green",
    "date": "08/2024",
    "title": "小慧🤖荣获国家二等奖",
    "description": "恭喜AI助理小慧获得第13届中国软件杯”大学生软件设计大赛国家二等奖！🥈",
    "titleLink": "https://www.bilibili.com/video/BV1UDWzeyEBB/"
  },
  {
    "tag": "gold",
    "date": "07/2024",
    "title": "小慧🤖荣获国家一等奖",
    "description": "热烈恭喜AI助理小慧获得（第16届）中国大学生计算机设计大赛（软件应用与开发赛道）国家一等奖！🥇",
    "titleLink": "https://www.bilibili.com/video/BV15MvLejEt5"
  },
]
var awards = [
  {
    "tier": "国家级",
    "rank": "国家奖学金",
    "name": "荣获国家奖学金（￥10000, 2/120）",
    "projectLink": "https://baike.baidu.com/item/%E5%9B%BD%E5%AE%B6%E5%A5%96%E5%AD%A6%E9%87%91/9693046?fr=ge_ala",
    "competition": "中国石油大学（华东）",
    "date": "2024-11-03"
  },
  
  {
    "tier": "国家级",
    "rank": "国家一等奖",
    "name": "基于文心大模型的第二课堂智能数据分析平台",
    "projectLink": "https://www.bilibili.com/video/BV15MvLejEt5",
    "competition": "(第16届)中国大学生计算机设计大赛（软件应用与开发赛道）",
    "competitionLink": "https://jsjds.blcu.edu.cn/",
    "date": "2024-07-25"
  },
  {
    "tier": "国家级",
    "rank": "国家二等奖",
    "name": "\"通慧智教\"——有温度，有感情的个性化教学平台",
    "projectLink": "https://www.bilibili.com/video/BV1UDWzeyEBB/",
    "competition": "第13届“中国软件杯”大学生软件设计大赛（A5赛道）",
    "competitionLink": "https://www.cnsoftbei.com/",
    "date": "2024-08-23"
  },
  {
    "tier": "国家级",
    "rank": "国家三等奖",
    "name": "基于多模态分析的心理健康群防教育系统",
    "competition": "2024中国高校计算机大赛-网络技术挑战赛（A1创意赛道）",
    "competitionLink": "https://net.c4best.cn/",
    "date": "2024-09-09"
  },
  {
    "tier": "国家级",
    "rank": "国家三等奖",
    "name": "深度学习风力发电实时预测系统",
    "projectLink": "https://www.bilibili.com/video/BV1kG411d7Zr/",
    "competition": "第13届“中国软件杯”大学生软件设计大赛",
    "competitionLink": "https://www.cnsoftbei.com/",
    "date": "2023-07-31"
  },
  {
    "tier": "国家级",
    "rank": "Honorable Mention",
    "name": "MCM Problem B：搜索潜水艇",
    "competition": "美国大学生数学建模大赛",
    "competitionLink": "https://www.comap.com/contests",
    "date": "2024-05-06"
  },
  {
    "tier": "省部级",
    "rank": "山东省一等奖",
    "name": "B题多波束测线问题",
    "competition": "全国大学生数学建模竞赛",
    "competitionLink": "http://www.mcm.edu.cn/",
    "date": "2023-09-20"
  },
  {
    "tier": "省部级",
    "rank": "华东赛区二等奖",
    "name": "SDN运维管理系统",
    "competition": "2023中国高校计算机大赛-网络技术挑战赛（BEP-4赛道）",
    "date": "2023-06-26"
  },
  {
    "tier": "省部级",
    "rank": "北部区域赛三等奖",
    "name": "AI赋能的个性化智能教学平台",
    "competition": "第十五届中国大学生服务外包-创新创业大赛",
    "date": "2024-06-01"
  },
  {
    "tier": "省部级",
    "rank": "省级赛优秀奖",
    "name": "中药工艺",
    "competition": "（第15届）中国大学生计算机设计大赛（数媒游戏交互赛道）",
    "date": "2023-08-01"
  },
  {
    "tier": "省部级",
    "rank": "定向越野省部级体育赛事",
    "name": "2023大运河定向巡回赛-位次：87",
    "competition": "江苏省国际体育交流中心",
    "date": "2023-05-03"
  },
  {
    "tier": "校级",
    "rank": "校级奖学金",
    "name": "2023-2024突出成绩奖学金",
    "competition": "中国石油大学（华东）",
    "date": "2024-12-07"
  },
  {
    "tier": "校级",
    "rank": "校级奖学金",
    "name": "2023-2024卓越之星奖学金",
    "competition": "中国石油大学（华东）",
    "date": "2024-12-07"
  },
  {
    "tier": "校级",
    "rank": "校级奖学金",
    "name": "2023-2024年科技创新奖学金",
    "competition": "中国石油大学（华东）",
    "date": "2024-10-22"
  },
  {
    "tier": "校级",
    "rank": "校级奖学金",
    "name": "2021-2022综合优秀奖学金",
    "competition": "中国石油大学（华东）",
    "date": "2022-12-01"
  },
  {
    "tier": "校级",
    "rank": "校级荣誉",
    "name": "2022-2023综合优秀奖学金",
    "competition": "中国石油大学（华东）",
    "date": "2023-12-01"
  },
  {
    "tier": "校级",
    "rank": "校级荣誉",
    "name": "2023-2024优秀学生",
    "competition": "中国石油大学（华东）",
    "date": "2023-10-29"
  },
  {
    "tier": "校级",
    "rank": "校级荣誉",
    "name": "2022-2023优秀学生",
    "competition": "中国石油大学（华东）",
    "date": "2023-11-01"
  },
  {
    "tier": "校级",
    "rank": "校级荣誉",
    "name": "2021-2022优秀学生",
    "competition": "中国石油大学（华东）",
    "date": "2023-02-01"
  },
  {
    "tier": "校级",
    "rank": "校级荣誉",
    "name": "优秀共青团员",
    "competition": "共青团中国石油大学（华东）委员会",
    "date": "2023-12-01"
  },
]

